Repository: 84000/data-translation-memory
Catalog: toh57-v3.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་ཚེ་དང་ལྡན་པ་དགའ་བོ་འཁོར་བའི་རྒྱ་མཚོ་འབྲོག་དགོན་པ་ལས་ཡང་དག་པར་འདས་ཏེ།
en: At that time, the venerable Nanda passed far beyond the wilderness of the sea of saṃsāra.

source: མཐར་ཐུག་པའི་བདེ་བ་མྱ་ངན་ལས་འདས་པའི་གནས་སུ་ཕྱིན་ནས་དགྲ་བཅོམ་པའི་འབྲས་བུ་ཐོབ་པར་གྱུར་པས་བདག་ཉིད་ཤིན་ཏུ་དགའ་བར་གྱུར་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། གུས་སེམས་ཁྲུས་ནི་བསྟབས་པ་དང་། །ཆུ་གཙང་བྱུག་སྤོས་ཕུལ་བ་དང་། །བསོད་ནམས་རྣམས་ནི་བསྒྲུབས་པས་ན། །རྣམ་སྨིན་མཆོག་འདི་ཐོབ་པ་ཡིན། །
en: Having gone to the place of ultimate bliss, nirvāṇa, and having obtained the fruit of arhatship, he was exceedingly happy and spoke in verse: “With a reverent mind, having donated a bath, And offering clean water and scented ointment, Since I have produced merit, I have obtained this supreme fruit.”

source: དེ་ནས་འཁོར་མང་པོ་རྣམས་དེ་སྐད་ཅེས་སྨྲས་པ་ཐོས་པས་ཐམས་ཅད་ཐེ་ཚོམ་དུ་གྱུར་ནས་ཐེ་ཚོམ་གཅད་པའི་ཕྱིར་སྟོན་པ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་ཚེ་དང་ལྡན་པ་དགའ་བོ་འདིས་སྔོན་སུག་ལས་ཅི་བགྱིས་ན་དེའི་རྣམ་པར་སྨིན་པས་ལུས་ཀྱི་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་གྱུར་ལ།
en: Then the numerous retinues, having heard what he said, all became uncertain, and in order to eliminate their uncertainty, asked the Great Teacher, “Venerable one, what action did this venerable Nanda formerly do, as reward for which the color of his body came to resemble the color of gold, he himself was adorned with the thirty marks, and he became only four finger-widths shorter than the Bhagavān?

source: མཚན་སུམ་ཅུ་དང་ལྡན་པས་བདག་ཉིད་བརྒྱན་ཅིང་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་བས་སོར་བཞེས་ཐུང་བར་གྱུར་ཅིའི་སླད་དུ་འདོད་པའི་ཡུལ་ལ་ཤིན་ཏུ་མངོན་པར་ཞེན་པ་ལས་སྟོན་པ་ཆེན་པོས་ཐུགས་བརྩེ་བར་དགོངས་ནས་མཐུས་འཁོར་བའི་རྒྱ་མཚོ་ལས་བསྒྲལ་ཏེ། ཐབས་ཀྱིས་ཤིན་ཏུ་མཐར་ཐུག་པའི་མྱ་ངན་ལས་འདས་པ་ལ་རྣམ་པར་གཞག་པ་བཀས་བཤད་དུ་གསོལ།
en: Please tell us why the Great Teacher took pity on Nanda for his strong attachment to desirable objects and, having freed him with his power from the ocean of saṃsāra, established him with skill in means in the final nirvāṇa?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དགེ་སློང་དགའ་བོས་སྔོན་ལས་མངོན་པར་འདུས་བྱས་པའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་སྨིན་པས་ན་ཐམས་ཅད་མངོན་དུ་གྱུར་པ་ཡིན་ནོ། །
en: The Bhagavān replied, “Monks, everything happened due to the maturation of the fruits produced by the monk Nanda’s past actions.”

source: ཞེས་གཞན་ནས་བསྟན་པ་བཞིན་དུ་རྒྱ་ཆེར་བཀའ་སྩལ་ནས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། གལ་ཏེ་བསྐལ་པ་བརྒྱ་ལོན་ཀྱང་། །ལས་བྱས་ཆུད་ཟར་མི་འགྱུར་ཏེ། །
en: After speaking in detail, as was taught elsewhere, he spoke in verse: “Even if one hundred eons have passed, Karma that is produced is never lost.

source: རྒྱུ་དང་རྐྱེན་ནི་ཚོགས་པ་ན། །ལུས་ཅན་ཉིད་ལ་འབྲས་བུར་སྨིན། །
en: When causes and conditions come together, Fruits mature for that very embodied one.

source: དགེ་སློང་དག་ཁྱད་ཉོན་ཅིག །
en: “Listen, you monks!

source: སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་གི་སྔོན་རོལ་ན་སྐྱེ་དགུ་རྣམས་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པའི་སྐྱེས་བུ་འདུལ་བ་ཁ་ལོ་སྒྱུར་བ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: In the past, ninety-one eons previously, when beings were able to live for eighty thousand years, the tathāgata, arhat, completely and perfectly awakened one, endowed with knowledge and conduct, the sugata, the knower of the world, the unsurpassed charioteer of humans to be trained, the teacher of gods and humans, the buddha and bhagavān named Vipaśyin appeared in the world.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། དགེ་སློང་གི་དགེ་འདུན་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་གཉིས་དང་ཐབས་ཅིག་ཏུ་ལྗོངས་རྒྱུ་ཞིང་གྲོང་ཁྱེར་མཉེན་ལྡན་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་གཤེགས་ནས་མཉེན་ལྡན་གྱི་ཚལ་ན་བཞུགས་སོ། །
en: Wandering through the land together with a saṅgha of sixty-two thousand monks, he went to the vicinity of the palace of the ruler of the town Soft and stayed in Soft Grove.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེའི་གཡས་ཁྱིམ་གྱི་གཅུང་ཞིག་ཡོད་པ་དེ་འདོད་པའི་ཡུལ་ལ་ཤིན་ཏུ་མངོན་པར་ཞེན་ཅིང་ཆགས་པ་ལས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་དེས་འཁོར་བའི་རྒྱ་མཚོ་ལས་ཡོངས་སུ་བཟླ་བའི་ཕྱིར་རབ་ཏུ་འབྱུང་བར་བསྐུལ་ནས་ཐབས་ཀྱིས་མཐར་ཐུག་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་རྣམ་པར་གཞག་གོ །
en: At that time, the Bhagavān had a younger brother by a different mother. Due to the brother’s great attachment to sensual objects and his greed, the tathāgata, arhat, perfectly awakened Buddha Vipaśyin urged him to go forth in order to pass beyond the ocean of saṃsāra and, with skillful means, established him in the state of final nirvāṇa.

source: དེའི་ཚེ་ན་ཡུལ་དེའི་བདག་པོ་མཉེན་ལྡན་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “At that time, the lord of that place, who was named Soft, governed.

source: འདི་ལྟར་རྒྱལ་པོ་ཆོས་ཀྱིས་མི་རྣམས་འདུལ་བ།
en: In this way, the king tamed the people with the Dharma.

source: མི་དང་སྐྱེ་བོ་མང་པོ་རྒྱས་པ། ལོ་ལེགས་ཤིང་བདེ་བ།
en: The many people flourished, and, having a good harvest, they were happy.

source: གཡོ་སྒྱུ་དང་ཆོམ་རྐུན་མེད་ཅིང་ནད་དང་བྲལ་བ། བ་ལང་དང་།
en: There were no cheaters or thieves, and they were free from illness.

source: ར་ལུག་དང་། སཱ་ལུ་དང་། བུ་རམ་ཤིང་ཀུན་ཏུ་གང་ཞིང་རྒྱས་པར་གྱུར་ཏེ།
en: Full of oxen, goats and sheep, rice, and sugarcane, the place flourished.

source: རྒྱལ་པོ་དེའི་གཡས་ཁྱིམ་གྱི་ནུ་བོ་ཞིག་ཡོད་པ་ཡང་ཤིན་ཏུ་འདོད་པ་ལ་མངོན་པར་ཞེན་ཅིང་ཆགས་པར་གྱུར་ཏོ། །
en: The king had a younger brother by a different mother, and he, too, had great attachment to the objects of sense desires and was greedy.

source: རྒྱལ་པོ་དེས་བཅོམ་ལྡན་འདས་འཁོར་དང་བཅས་ཏེ་མཉེན་ལྡན་གྱི་ཚལ་ན་བཞུགས་པར་ཐོས་པས་བཙུན་མོ་དང་། གཞོན་ནུ་དང་། བློན་པོ་དང་། སྐྱེ་བོ་མང་པོའི་ཚོགས་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ།
en: The king heard that the Bhagavān, together with his retinue, was staying in Soft Grove, and, together with his queens, the prince, the ministers, and a group of many people, he went to where the Bhagavān was.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་དེས་རྒྱལ་པོ་འཁོར་དང་བཅས་པ་ལ་ཤིན་ཏུ་གྱ་ནོམ་པའི་ཆོས་ཀྱི་གཏམ་ཀུན་ཏུ་བསྟན་ཅིང་གཟེངས་བསྟོད་པས་ཁྱད་པར་དུ་འཕགས་པའི་ཤེས་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Having paid homage with his head at the feet of the Bhagavān, he sat to one side, and since the Bhagavān instructed the king and his retinue with a very excellent Dharma sermon and encouraged them, they acquired exalted knowledge.

source: དེའི་ནུ་བོ་འདོད་པ་ལ་ཞེན་ཅིང་ཁྱིམ་ནས་འབྱུང་དུ་མ་བཏུབ་པ་དང་། དེའི་ཚེ་དེ་ལ་བློན་པོའི་བུ་དང་། གཞན་ཡང་སྔ་ནས་ལྷན་ཅིག་རྩེ་རྩེ་བའི་གྲོགས་པོ་དག་གིས་ཀྱེ་གྲོགས་པོ་ཤེས་པར་གྱིས་ཤིག །འདི་ལྟར་རྒྱལ་པོ་ནི་གཞོན་ནུ་དང་། །
en: The king’s younger brother, being attached to sense pleasures, was not able to go forth from home, and the sons of ministers and other friends with whom he had formerly played said, ‘Hey, friend, remember—the king, the prince, the retinue of queens, the ministers, together with a multitude of people, went to where the Tathāgata Vipaśyin is and, by listening with reverence to the holy Dharma, acquired exalted knowledge.

source: བཙུན་མོའི་འཁོར་དང་བློན་པོ་དང་། སྐྱེ་བོ་མང་པོ་དང་བཅས་ཏེ། དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་ག་ལ་བ་དེར་དོང་སྟེ། གུས་པས་དམ་པའི་ཆོས་མཉན་པས་ཁྱད་པར་དུ་འཕགས་པའི་ཤེས་པ་ཐོབ་པར་གྱུར་ཏེ། འདི་ལྟར་ཁྱོད་ཀྱང་མི་ལུས་ཤིན་ཏུ་ཐོབ་པར་དཀའ་བ་ལས་དེང་ཐོབ་པར་གྱུར་ན་ཅིའི་ཕྱིར་འདོད་པ་ལ་མངོན་པར་ཞེན་ཅིང་ཆགས་ནས་སྒོར་ཡང་འབྱུང་དུ་མི་བཏུབ་ཅེས་སྨྲས་པ་དང་།
en: Thus, you, too, since you have now obtained a human body that is exceedingly difficult to obtain, why, being attached to sense pleasures and greedy, are you not able to even get out the door?’

source: དེས་ཀྱང་དེ་སྐད་དུ་སྤྱོ་བ་ཐོས་པས་ཤིན་ཏུ་ངོ་ཚ་བར་གྱུར་ནས་དེ་དག་གི་རྗེས་སུ་འབྲངས་ཏེ་ལྷན་ཅིག་དོང་ངོ་། །
en: Having heard this scolding, the king’s younger brother became very ashamed.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེའི་གཅུང་དགེ་སློང་དེས་མང་པོ་དེ་དག་ལྷན་ཅིག་འགྲོགས་ཏེ་དོང་བ་མཐོང་ནས་ཀྱེ་ཁྱེད་ཅིའི་ཕྱིར་མི་འདི་གཅིག་པུ་ཁྲིད་ནས་ལྷན་ཅིག་འགྲོགས་ཏེ་འགྲོ་ཞེས་དྲིས་པ་དང་།
en: Following behind them, he went with them. “At that time, the monk who was the Bhagavān’s younger brother saw those many people going together in a group and asked them, ‘Hey, why do you go together in a group leading this solitary man?’

source: དེ་དག་གིས་ཀྱང་ཇི་ལྟར་གྱུར་པ་ཞིབ་ཏུ་སྨྲས་སོ། །
en: They told him in detail what had happened.

source: དགེ་སློང་དེས་སྨྲས་པ།
en: The monk then said, ‘I am the Bhagavān’s younger brother.

source: བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་གཅུང་ཡིན་ཏེ་སྔོན་ཁྱིམ་ན་གནས་པའི་ཚེ་འདོད་པའི་ཡུལ་རྣམས་ལ་ཤིན་ཏུ་མངོན་པར་ཞེན་ཅིང་ཆགས་པ་ལས་སྟོན་པ་ཆེན་པོས་ཐུགས་རྗེར་དགོངས་ནས་མཐུས་འཁོར་བ་ལས་བཟླས་ཏེ་མཐར་ཐུག་པའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་པ་ཡིན་ནོ། །
en: Formerly, when I was a layman, because I was very attached to the objects of sense desires and greedy, the Great Teacher, thinking of me with compassion, delivered me from saṃsāra with his power and established me in final nirvāṇa.

source: གཞན་ཡང་སྐྱེས་བུ་གླེན་པ་བདག་དང་འདྲ་བ་འདི་ལྟ་བུ་ཡོད་པ་ལས་ཁྱེད་ཀྱིས་སྙིང་བརྩེ་ནས་ལྷན་ཅིག་ཁྲིད་དེ་འོངས་པ་ཤིན་ཏུ་ལེགས་སོ། །
en: Furthermore, since there is this sort of foolish person, just like me, it is very good that, out of compassion, you have come together, leading him.

source: དེང་བླ་ན་མེད་པའི་སྟོན་པ་ཆེན་པོ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ཁྲིད་ཅིག་དང་གདོན་མི་ཟ་བར་ཤིན་ཏུ་དད་པ་སྐྱེ་བར་འགྱུར་རོ། །ཞེས་སྨྲས་པས་དེ་དག་ཀྱང་ལྷན་ཅིག་འགྲོགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་བ་དང་།
en: Now, lead him to the place where the Bhagavān, the unsurpassed great teacher, is, and he will undoubtedly give rise to great faith.’

source: བཅོམ་ལྡན་འདས་དེས་ཀྱང་དེ་དག་ལ་གཟིགས་ནས་དབང་པོ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་དག་པར་བསྟན་པས་དེ་དག་གིས་ཐོས་པར་གྱུར་ནས་ཤིན་ཏུ་དད་པ་སྐྱེས་པས་འདུག་པའི་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “After the monk said that, they went together to the place where the Bhagavān was and the Bhagavān, seeing them, correctly taught them according to their faculties and their resolve. As they listened, he gave rise to great faith.

source: བཅོམ་ལྡན་འདས་སྟོན་པ་ཆེན་པོ་འཕགས་པའི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་གི་གདུགས་ལ་བདག་གི་སྡུམ་པར་བསྲོ་ཁང་དུ་ཁྲུས་ལ་གཤེགས་པར་ཅིག་ནང་ཞེས་གསོལ་པ་དང་།
en: He got up from his seat, removed his robe from one shoulder, joined his hands together, and said to the Bhagavān, ‘Bhagavān, Great Teacher, will you agree to come, together with the noble saṅgha, to bathe in the bathhouse in my home tomorrow at noon?’

source: བཅོམ་ལྡན་འདས་ཀྱང་ཅང་མི་གསུང་བར་གཤེགས་པར་ཞལ་གྱིས་བཞེས་སོ། །
en: The Bhagavān, saying nothing, agreed to go.

source: དེས་ཀྱང་ཞལ་གྱིས་བཞེས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཕྱག་བྱས་ཏེ་སོང་ངོ་། །དེ་ནས་རྒྱལ་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། རྒྱལ་པོ་ལ་ལུས་གུས་པས་ཕྱག་བྱས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Knowing that he had agreed to come, the king’s younger brother paid homage at the Bhagavān’s feet and left.

source: རྒྱལ་པོ་ཆེན་པོ་བདག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་མཆིས་ནས་ཆོས་ཐོས་པ་དང་།
en: “Then he arrived at the place where the king was, and respectfully paying homage to the king, he said, ‘Great king, having gone to where the Bhagavān is, I listened to the Dharma, and, having given rise to great faith, I gave rise to a mental state of disillusionment with the objects of sense desires.

source: ཤིན་ཏུ་དད་པ་སྐྱེས་ཏེ་འདོད་པའི་ཡུལ་རྣམས་ལ་ཡོངས་སུ་སྐྱོ་བའི་སེམས་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་སང་གི་གདུགས་ལ་བདག་གི་སྡུམ་པར་བསྲོ་ཁང་དུ་ཁྲུས་ལ་གཤེགས་པར་གསོལ་བ་ལས་དེ་བཞིན་གཤེགས་པ་སྟོན་པ་ཆེན་པོས་ཀྱང་ཐུགས་བརྩེ་བར་དགོངས་ནས་གཤེགས་པར་ཞལ་གྱིས་བཞེས་ཏེ།
en: Then I asked the Bhagavān to come, together with the saṅgha of śrāvakas, to bathe in the bathhouse in my home tomorrow at noon. The Great Teacher, the Tathāgata, thought of me compassionately and agreed to come.

source: བཅོམ་ལྡན་འདས་དེ་ནི་ལྷ་དང་མི་རྣམས་ཀྱིས་མཆོད་པར་བགྱི་བའི་འོས་སུ་གྱུར་པ་ལགས་ན་ལྷས་ཀྱང་གྲོང་ཁྱེར་གྱི་ཤུལ་དང་སྲང་རྣམས་ཕྱག་དར་བྱས་ནས་ཆག་ཆག་བཏབ་སྟེ་མཛེས་པར་བགྱི་བའི་རིགས་སོ་ཞེས་སྨྲས་པ་དང་།
en: The Bhagavān is worthy of being honored by gods and humans.

source: རྒྱལ་པོས་འདི་སྙམ་དུ་བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་དུ་གཤེགས་ན་བདག་གི་གྲང་ཁྱེར་མཛེས་པར་བྱ་མོད་ཀྱི་འོན་ཀྱང་བདག་གི་ནུ་བོ་འདོད་པ་ལ་མངོན་པར་ཞེན་ནས་བཟློག་པ་དཀའ་བ་ལས་དེང་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུལ་བར་གྱུར་པ་ནི་ཡང་དག་པར་ངོ་མཚར་ཆེའོ་སྙམ་དུ་བསམས་ནས་ནུ་བོ་ཤིན་ཏུ་ལེགས་ཀྱིས་ཁྱོད་སོང་ལ་ཁྲུས་ཀྱི་ཡོ་བྱད་ཅི་དགོས་པ་སྦྱོར་ཅིག་དང་།
en: This being so, it is right that Your Majesty should sweep the paths and roads of the city and sprinkle them with water and make it beautiful.’ “The king thought, ‘If the Bhagavān comes to the city, I must make my city beautiful, but, since my younger brother is attached to sense pleasures and is difficult to reform, it would really be wonderful if the Bhagavān would now tame him.’ The king said, ‘Very good, younger brother. Go and prepare whatever articles are necessary for the bath.

source: ངས་ཀྱང་ཅི་ནུས་ཀྱིས་གྲོང་ཁྱེར་བརྒྱན་པར་བྱའོ་ཞེས་སྨྲས་པས་རྒྱལ་པོའི་ནུ་བོ་ཡང་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ་རྒྱལ་པོ་ལ་ཕྱག་བྱས་ནས་ལངས་ཏེ་སོང་ངོ་། །
en: And I must decorate the city as much as possible.’ The king’s younger brother was overjoyed, and he paid homage to the king, got up, and left. Then the king instructed his ministers, ‘Hey, you. Now make an announcement in the city.

source: དེ་ནས་རྒྱལ་པོས་བློན་པོ་རྣམས་ལ་བསྒོ་བ་ཀྱེ་ཁྱེད་ཅག་དེང་ལ་གྲོང་ཁྱེར་དུ་དྲིལ་ཆེན་བསྒྲགས་ཏེ་ཕྱོགས་སུ་འདི་སྐད་དུ་སང་བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་དུ་གཤེགས་ཀྱིས་གྲོང་ཁྱེར་ན་གནས་པ་དང་ཡུལ་སོ་སོ་ནས་ལྷགས་པའི་སྐྱེ་བོ་རྣམས་སོ་སོ་ནས་ཅི་ནུས་ཀྱིས་གྲོང་ཁྱེར་མཛེས་པར་གྱིས་ལ་ལམ་དང་སྲང་རྣམས་ཕྱག་དར་བྱས་ཏེ་ཆག་ཆག་བཏབ་ནས་མེ་ཏོག་དང་སྤོས་དང་དྲི་རྣམས་ཐོགས་ཏེ། སྟོན་པ་ཆེན་པོ་གཤེགས་པ་སུ་ཤིག་ཅེས་སྒོ་ཤིག །
en: Tell the people living in the city and those from various places that the Bhagavān will come to the city tomorrow and that they should each make the city as beautiful as possible and sweep the paths and roads, sprinkle them with water, and, taking flowers and incense and perfume, go welcome the Great Teacher.’

source: བློན་པོ་རྣམས་ཀྱིས་ཀྱང་ལྷ་དེ་བཞིན་འཚལ་ལོ་ཞེས་རྒྱལ་པོའི་བཀའ་ཁྱེར་ནས་ཕྱོགས་སུ་གོ་བར་བསྒོ་ཞིང་དྲིལ་ཆེན་གྱི་སྒྲ་བསྒྲགས་པས་སྐྱེ་བོ་རྣམས་གྲོང་ཁྱེར་དེའི་རྡོ་བ་དང་གྱོ་མོ་དང་བོང་བ་རྣམས་བསལ་ཏེ།
en: “ ‘It will be done according to Your Majesty’s command,’ said the ministers. “Conveying the king’s orders, they commanded everyone to understand, making the announcement, and the people removed the stones, pottery shards, and clods of dirt in the city.

source: ས་སྤོས་ཀྱི་ཆུས་ཀུན་ཏུ་ཁྱབ་པར་ཆག་ཆག་བཏབ་ནས་བདུག་པ་དམ་པ་རྣམས་ཀྱང་བསྲེགས་གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་མང་པོ་ཡང་བཙུགས་ཏེ་མེ་ཏོག་རྣམས་མངོན་པར་གཏོར་བས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་སྐྱེད་མོས་ཚལ་དགའ་བ་བཞིན་དུ་བྱས་སོ། །
en: Having sprinkled the ground all over with perfumed water, they burned excellent incense; they raised many umbrellas, victory banners, and flags; and, by strewing flowers, they made the city resemble the pleasure garden of Śakra, lord of the gods.

source: དེའི་ཚེ་རྒྱལ་པོའི་ནུ་བོས་ཀྱང་སྤོས་ཆུ་དང་སྤོས་མར་ལ་སོགས་པ་སྦྱར་ཏེ་བསྲོ་ཁང་མཛེས་པར་བྱས་ཁྲི་བཤམས་ནས་གདན་ཡང་བཏིང་ངོ་། །དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་མཐར་གྱིས་གྲོང་ཁྱེར་དུ་གཤེགས་སུ་ཉེ་བ་དང་། རྒྱལ་པོ་དང་།
en: “At that time, the king’s younger brother prepared fragrant water, fragrant oil, and so forth, and, having made the bathhouse beautiful, he prepared a seat and spread out a mat.

source: རྒྱལ་བུ་དང་། བློན་པོ་དང་། བཙུན་མོ་དང་། སླས་དང་། སྐྱེ་བོ་མང་པོ་རྣམས་གྲོང་ནས་བྱུང་སྟེ།
en: The Tathāgata Vipaśyin gradually approached the city, and the king, the prince, the ministers, the queens, the queens’ attendants, and a multitude of people came out from the city.

source: དེ་བཞིན་གཤེགས་པ་བསུ་ནས་རྒྱང་ནས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱས་ཏེ་ཞབས་འབྲིང་བྱས་ནས་གྲོང་ཁྱེར་དུ་གཤེགས་པ་དང་།
en: After welcoming the Tathāgata, they paid homage from a distance and attended upon him and entered the city.

source: དེའི་ཚེ་རྒྱལ་པོའི་ནུ་བོ་དེས་ཀྱང་བཅོམ་ལྡན་འདས་བསྲོ་ཁང་དུ་གཤེགས་པར་སྤྱན་དྲངས་ཏེ།
en: At that time, the king’s younger brother invited the Bhagavān to come to his bathhouse.

source: སྤོས་ཆུ་ལ་སོགས་པ་ཕུལ་ནས་སྐུ་བསིལ་བར་གསོལ་ཏེ།
en: He offered fragrant water and so forth and invited him to bathe.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་གསེར་གྱི་ཁ་དོག་ཅན་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ཡོངས་སུ་བརྒྱན་པ་མཐོང་བ་དང་། རབ་ཏུ་དགའ་ནས་ཤིན་ཏུ་དང་བའི་དད་པ་སྐྱེས་པར་གྱུར་ཏོ། །
en: He saw the Bhagavān’s gold-colored body adorned with the thirty-two marks and the eighty minor marks, and, overjoyed, he gave rise to a very pure faith.

source: སྐུ་བསིལ་ནས་ན་བཟའ་མནབས་པ་དང་།
en: After bathing, the Bhagavān got dressed.

source: དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས་འདི་སྐད་དུ་དེང་བདག་གིས་བསོད་ནམས་ཀྱི་ཞིང་མཆོག་དམ་པ་ལ་མཆོད་པ་ཅུང་ཟད་བགྱིས་པ་འདིའི་དགེ་བའི་རྩ་བས་མ་འོངས་པའི་དུས་ན་བཅོམ་ལྡན་འདས་འདི་དང་ཐ་དད་པ་མེད་པའི་གསེར་གྱི་ཁ་དོག་ཅན་གྱི་ལུས་ཐོབ་པར་གྱུར་ཅིག །
en: Having paid homage with his head at the two feet of the Bhagavān, the younger brother, making an aspiration, said, ‘Now I have performed a trifling act of worship to the most excellent field of merit. Due to this root of virtue, may I obtain in the future a golden body no different from that of the Bhagavān.

source: ཇི་ལྟར་བཅོམ་ལྡན་འདས་འདིའི་གཅུང་འདོད་པའི་ཡུལ་ལ་མངོན་པར་ཞེན་ཅིང་ཆགས་པ་ལས་མཐུས་ཡོངས་སུ་བཟླས་ཏེ། ཤིན་ཏུ་མཐར་ཐུག་པའི་མྱ་ངན་ལས་འདས་པ་ལ་གཞོལ་བར་འགྱུར་བ་དེ་བཞིན་དུ་བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པའི་གཅུང་དུ་གྱུར་ནས་གསེར་གྱི་ཁ་དོག་ཅན་གྱི་ལུས་ཐོབ་པར་གྱུར་ཏེ།
en: Just as the Bhagavān’s brother was delivered from his attachment to the objects of sense desires and his greed by the Bhagavān’s power and led to the final nirvāṇa, in the same way, in the future, may I, too, becoming the younger brother of the Tathāgata, obtain a golden body.

source: འདི་ལྟར་བདག་འདོད་པའི་ཡུལ་ལ་མངོན་པར་ཞེན་ཅིང་ཆགས་པར་གྱུར་པ་ན་ཡང་མཐུས་སྲེད་པའི་ཆུ་བོ་ཟབ་མོ་ལས་ཡོངས་སུ་བཟླས་ཏེ་མྱ་ངན་ལས་འདས་པའི་བདེ་བ་ལ་གཞོག་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ། །
en: When I am attached to the objects of sense desires and greedy, may I too be delivered by the Bhagavān’s power from the deep river of craving and established in the bliss of nirvāṇa.’

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་མཉེན་ལྡན་གྱི་ནུ་བོ་འདོད་པ་ལ་མངོན་པར་ཞེན་པར་གྱུར་པ་དེ་གཞན་ཡིན་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་ལྟ་སྟེ།
en: “Monks, if you think that the one who was, at that time, the younger brother of King Soft, who was attached to sense pleasures, was someone else, do not see it that way.

source: དེ་ནི་དགེ་སློང་དགའ་བོ་འདི་ཉིད་ཡིན་ནོ། །
en: He was the monk Nanda himself.

source: འདིས་སྔོན་འདས་པའི་དུས་སུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་བསྲོ་ཁང་དུ་གཤེགས་པར་གསོལ་ནས་སྤོས་ཆུ་ལ་སོགས་པས་སྐུ་བསིལ་ཏེ།
en: In the past, he invited the Tathāgata Vipaśyin to come to his bathhouse to bathe with fragrant water and so forth.

source: ཤིན་ཏུ་དང་བའི་དད་པས་སྨོན་ལམ་བཏབ་པ་དེའི་དགེ་བའི་རྩ་བའི་རྒྱུས་དེང་དེ་བཞིན་གཤེགས་པའི་གཅུང་དུ་གྱུར་ནས་ལུས་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་གྱུར་པ་དང་།
en: With very pure faith, he made an aspiration, and due to his roots of virtue, he has now become the Tathāgata’s younger brother, and his body has become like gold in color.

source: འདོད་པའི་ཡུལ་ལ་མངོན་པར་ཞེན་ཅིང་ཆགས་པ་ལས་ངས་མཐུས་ཕྱུང་སྟེ།
en: With my power, I have rescued him from his attachment to the objects of sense desires and his greed.

source: ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་མཐར་ཐུག་པའི་མྱ་ངན་ལས་འདས་པ་ཤིན་ཏུ་བདེ་བའི་གནས་སུ་ཕྱིན་པར་གྱུར་པ་ཡིན་ནོ། །
en: He has gone forth from his home into homelessness, and he has arrived at final nirvāṇa, the state of total bliss.”

source: དེ་ནས་འཁོར་མང་པོ་རྣམས་ཐེ་ཚོམ་དུ་གྱུར་ནས་ཡང་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་ཚེ་དང་ལྡན་པ་དགའ་བོས་སྔོན་ལས་ཅི་བགྱིས་ན་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་མངོན་པར་གྲུབ་པ་ལགས།
en: Then, the numerous retinues became uncertain and again asked the Bhagavān, “Venerable one, what did the venerable Nanda do in the past that he should obtain the thirty marks of a great man?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདིས་ལས་མངོན་པར་འདུས་བྱས་པས་ན་ཞེས་བྱ་བ་ལ་སོགས་པ་རྒྱ་ཆེར་སྔ་མ་བཞིན་ཏེ།
en: The Bhagavān replied, “Monks, it is due to the karma that he produced” and so forth, in detail just as before.

source: སྔོན་འདས་པའི་དུས་སུ་རི་བྲགས་ཀྱི་གྲོང་གཞན་ཞིག་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་བ།
en: “In the past, in an outlying village, lived a rich householder with a great deal of wealth, not lacking in necessities.

source: ཡོ་བྱད་ཀྱིས་བྲེལ་བ་མེད་པ་ཞིག་གནས་པ་དེ་ལ་སྐྱེད་མོས་ཚལ་མེ་ཏོག་དང་འབྲས་བུ་རྒྱས་ཤིང་ཆུ་མིག་དང་། འབབ་ཆུ་དང་། ལྗོན་ཤིང་དང་ལྡན་པ། རབ་ཏུ་བྱུང་བའི་དབེན་གནས་སུ་འོས་པ་ཞིག་ཡོད་དེ།
en: He had a pleasure garden full of flowers and fruit, a fountain, a waterfall, and trees, suitable for a monk’s hermitage.

source: དེའི་ཚེ་རང་སངས་རྒྱས་སེམས་ཅན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་འཇིག་རྟེན་དུ་བྱུང་ནས་དབེན་པ་ན་གནས་པ་ཡོད་པས་ནམ་འཇིག་རྟེན་དུ་སངས་རྒྱས་མི་འབྱུང་བའི་ཚེ་འདི་འབའ་ཞིག་བསོད་ནམས་ཀྱི་ཞིང་དུ་གྱུར་ཏེ།
en: At that time, there were pratyekabuddhas who, because of their compassion for beings, appeared in the world and lived in solitary places. At that time, when no buddha had arisen in the world, they were the only fields of merit.

source: དེ་ནས་སངས་རྒྱས་གཞན་ཞིག་ལྗོངས་རྒྱུ་ཞིང་རི་བྲགས་ཀྱི་གྲོང་དེར་ཕྱིན་ནས་ཕན་ཚུན་ཀུན་ཏུ་བརྟགས་ཏེ།
en: A pratyekabuddha, wandering through the country, arrived at that outlying village and looked all over.

source: གནས་བཙལ་བ་ལས་དེའི་སྐྱེད་མོས་ཚལ་དུ་ཕྱིན་པ་དང་སྐྱེད་མོས་ཚལ་དེ་སྲུང་བའི་མིས་འཕགས་པ་དེ་མཐོང་ནས་བདེ་བར་གཤེགས་པ་མཉེལ་བསོ་བའི་སླད་དུ་འཕགས་པ་འདི་བཞུགས་སུ་གསོལ་ཞེས་སྨྲས་སོ། །
en: Having searched for a place to stay, he arrived at the pleasure garden. The man who guarded the pleasure garden, having seen the noble one, said, ‘Did you travel safely? Noble one, please stay here to recover from your weariness.’

source: དེས་ནམ་གྱི་གུང་ཐུན་ལ་མེའི་ཁམས་ལ་སྙོམས་པར་ཞུགས་པ་དང་། སྐྱེད་མོས་ཚལ་སྲུང་བའི་མིས་མཐོང་ནས་འདི་སྙམ་དུ་བཙུན་པ་ཆེན་པོ་འདི་ནི་འདི་ལྟ་བུའི་སྤྱོད་པ་མཆོག་གྲུབ་པོ་སྙམ་དུ་བསམས་ནས་དེ་ནས་ནུབ་མོ་ལངས་ཏེ།
en: “At midnight, he was absorbed in equipoise on the fire element, and the man who guarded the pleasure garden saw him and thought, ‘This great venerable one is one who has perfected this sort of outstanding practice.’

source: ཁྱིམ་བདག་ག་ལ་བ་དེར་སོང་ནས་འདི་སྐད་དུ་ཁྱིམ་བདག་ཆེན་པོ་དེང་དགའ་བ་ཆེན་པོ་སྐྱེད་ཅིག །
en: Therefore, he got up during the night and, going to the place where the householder was, said, ‘Great householder, now give rise to great joy.

source: སྐྱེད་མོས་ཚལ་ན་འཕགས་པ་ཞིག་བདག་གི་ཐད་དུ་གཤེགས་ནས་མཚན་མོ་གནས་པ་ལས་དེའི་སྤྱོད་པ་གྱ་ནོམ་པ་དང་ལྡན་ཞིང་རྫུ་འཕྲུལ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ་ཞིག་པས་འོད་ཟེར་ཆེན་པོ་བཀྱེ་ནས་བསྐྱེད་མོས་ཚལ་གྱི་ནང་ཀུན་ཏུ་གསལ་བར་བྱས་སོ་ཞེས་སྨྲས་པ་ཁྱིམ་བདག་གིས་ཐོས་ནས་མྱུར་ཞིང་རིངས་པར་སྐྱེད་མོས་ཚལ་དུ་སོང་སྟེ།
en: A noble one came to me in the pleasure garden and stayed the night. He is engaged in a sublime practice and, since he possesses great magical power, he emits a great light and it illuminates the pleasure garden.’ “The householder heard what he said and quickly hurried to the pleasure garden.

source: རྐང་པ་གཉིས་ལ་ཕྱག་བྱས་ནས་འདི་སྐད་དུ་འཕགས་པ་ནི་བསོད་སྙོམས་བཞེད་པ་ལགས་ལ་བདག་ནི་བསོད་ནམས་འཚལ་བ་ལགས་ན་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། སྐྱེད་མོས་ཚལ་འདིར་བཞུགས་སུ་གསོལ།
en: Paying homage at the pratyekabuddha’s two feet, he said, ‘Noble one, since you wish for alms and I seek merit, think compassionately of me and please stay in this pleasure garden.

source: བདག་གིས་རྟག་པར་བསོད་སྙོམས་སྦྱར་རོ་ཞེས་སྨྲས་པ་དང་།
en: I will always provide you with alms.’

source: དེས་ཀྱང་དེས་གུས་པས་གསོལ་བ་བཏབ་པར་མཐོང་ནས་ཁས་བླངས་ཏེ། སྐྱེད་མོས་ཚལ་དེའི་ནང་དུ་གནས་ནས་བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་མཆོག་ལ་སྙོམས་པར་ཞུགས་ཏེ། བདེ་བ་རྗེས་སུ་མྱོང་བར་གྱུར་ཏོ། །
en: The pratyekabuddha, seeing that the householder was entreating him reverently, consented, and, dwelling in that pleasure garden, entered into equipoise in meditative concentration and the supreme liberation and experienced bliss.

source: དུས་གཞན་ཞིག་ན་དེ་འདི་སྙམ་དུ་བདག་གི་ལུས་རུལ་བ་འདི་ནི་འཁོར་བར་འཁོར་བ་ལས་བདག་གིས་གང་བྱ་བ་དེ་ནི་ཐོབ་པར་གྱུར་པས་མྱ་ངན་ལས་འདས་པ་ཞི་བའི་དབྱིངས་སུ་ཞུགས་ནས་གཏན་དུ་མི་སྐྱེ་བ་དེ་མངོན་སུམ་དུ་བྱ་བའི་རིགས་སོ་སྙམ་ནས་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ།
en: “At another time, the pratyekabuddha thought, ‘This putrid body of mine has been cycling in saṃsāra. Since I have achieved what was to be done, it is appropriate for me to enter nirvāṇa, the state of peace, and actualize never being born again.’ Thinking this, he rose up into the sky.
